<a href="https://colab.research.google.com/github/Tizzy1999/ml2019/blob/master/data_cleaning_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

In [0]:
import pandas as pd
import numpy as np
df = pd.read_csv('/content/gdrive/My Drive/201911ML/BL-Flickr-Images-Book.csv')
df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 15 columns]

In [0]:
to_drop = ['Edition Statement',
           'Corporate Author',
            'Corporate Contributors',
            'Former owner',
            'Engraver',
            'Contributors',
            'Issuance type',
            'Shelfmarks']
          
df.drop(columns=to_drop, inplace=True)

In [0]:
# replace index with column 'indentifier'
df['Identifier'].is_unique
df.set_index('Identifier', inplace=True)

In [0]:
# label based indexing
df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 206, dtype: object

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8287 entries, 206 to 4160339
Data columns (total 6 columns):
Place of Publication    8287 non-null object
Date of Publication     8106 non-null object
Publisher               4092 non-null object
Title                   8287 non-null object
Author                  6509 non-null object
Flickr URL              8287 non-null object
dtypes: object(6)
memory usage: 773.2+ KB

In [0]:
df.loc[1905:, 'Date of Publication'].head(30)

Identifier
1905                   1888
1929            1839, 38-54
2836                   1897
2854                   1865
2956                1860-63
2957                   1873
3017                   1866
3131                   1899
4598                   1814
4884                   1820
4976                   1800
5382     1847, 48 [1846-48]
5385                [1897?]
5389                [1897?]
5432                   1893
6036                   1805
6821                   1837
7521                   1896
7630                   1898
8239                   1899
8435                   1892
8440                   1894
11361              [1894-96
11852                   NaN
13074                  1899
13364                [1885]
14466               [1860?]
14703                  1846
15141                  1893
15146                  1894
Name: Date of Publication, dtype: object

In [0]:
# constructing year pattern
regex = r'^(\d{4})'
# extract the pattern from the raw data
extr = df['Date of Publication'].str.extract(regex, expand=False)
extr.loc[1905:].head(30)

Identifier
1905     1888
1929     1839
2836     1897
2854     1865
2956     1860
2957     1873
3017     1866
3131     1899
4598     1814
4884     1820
4976     1800
5382     1847
5385      NaN
5389      NaN
5432     1893
6036     1805
6821     1837
7521     1896
7630     1898
8239     1899
8435     1892
8440     1894
11361     NaN
11852     NaN
13074    1899
13364     NaN
14466     NaN
14703    1846
15141    1893
15146    1894
Name: Date of Publication, dtype: object

In [0]:
df['Date of Publication'] = pd.to_numeric(extr)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8287 entries, 206 to 4160339
Data columns (total 6 columns):
Place of Publication    8287 non-null object
Date of Publication     7316 non-null float64
Publisher               4092 non-null object
Title                   8287 non-null object
Author                  6509 non-null object
Flickr URL              8287 non-null object
dtypes: float64(1), object(5)
memory usage: 773.2+ KB

In [0]:
df['Date of Publication'].isnull().sum()/len(df)

0.11717147339205986

In [0]:
df['Place of Publication'].head(30)

Identifier
206                                  London
216                London; Virtue & Yorston
218                                  London
472                                  London
480                                  London
481                                  London
519                                  London
667     pp. 40. G. Bryan & Co: Oxford, 1898
874                                 London]
1143                                 London
1280                               Coventry
1808                            Christiania
1905                                Firenze
1929                              Amsterdam
2836                                 Savona
2854                                 London
2956                                  Paris
2957                                  Paris
3017                            Puerto-Rico
3131                               New York
4598                                   Hull
4884                                 London
4976                                 Oxonii
5382                                 London
5385                                 London
5389                                 London
5432                                 Milano
6036                                 London
6821                               Aberdeen
7521                                   Wien
Name: Place of Publication, dtype: object

In [0]:
print(df['Place of Publication'].loc[4157862])
print(df['Place of Publication'].loc[4159587])

Newcastle-upon-Tyne
Newcastle upon Tyne

In [0]:
pub = df['Place of Publication']
# get a boolean mask for London
london = pub.str.contains('London')
# return True when the target string contains 'London'
print(london[:10])
# get a boolean mask for Oxford
oxford = pub.str.contains('Oxford')
# return True when the target string contains 'Oxford'
print(oxford[:10])

Identifier
206      True
216      True
218      True
472      True
480      True
481      True
519      True
667     False
874      True
1143     True
Name: Place of Publication, dtype: bool
Identifier
206     False
216     False
218     False
472     False
480     False
481     False
519     False
667      True
874     False
1143    False
Name: Place of Publication, dtype: bool

###**np.where(condition, then, else)**
* *condition*: an array-like object or boolean mask
* *then*: the value to be used if condition evaluates to True
* *else*: the value to be used otherwise
* it can be nested into a compound if-then statement, allowing computing values based on multiple conditions

In [0]:
df['Place of Publication'] = np.where(london, 'London', 
                                      np.where(oxford, 'Oxford',
                                               pub.str.replace('-',' ')))
print(df['Place of Publication'].loc[4157862])
print(df['Place of Publication'].loc[4159587])
print(df['Place of Publication'].head(10))

Newcastle upon Tyne
Newcastle upon Tyne
Identifier
206     London
216     London
218     London
472     London
480     London
481     London
519     London
667     Oxford
874     London
1143    London
Name: Place of Publication, dtype: object

###**.applymap()**

* apply a self-defined function to all elements inside a dataframe

In [0]:
university_towns = []
with open('/content/gdrive/My Drive/201911ML/university_towns.txt') as file:
  for line in file:
    if '[edit]' in line:
      # Remember this 'state' until the next is found
      state = line
    else:
      # Append the (state, city) tuples
      university_towns.append((state, line))
university_towns[:10]

[('Alabama[edit]\n', 'Auburn (Auburn University)[1]\n'),
 ('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n'),
 ('Alabama[edit]\n', 'Livingston (University of West Alabama)[2]\n'),
 ('Alabama[edit]\n', 'Montevallo (University of Montevallo)[2]\n'),
 ('Alabama[edit]\n', 'Troy (Troy University)[2]\n'),
 ('Alabama[edit]\n',
  'Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]\n'),
 ('Alabama[edit]\n', 'Tuskegee (Tuskegee University)[5]\n'),
 ('Alaska[edit]\n', 'Fairbanks (University of Alaska Fairbanks)[2]\n'),
 ('Arizona[edit]\n', 'Flagstaff (Northern Arizona University)[6]\n')]

In [0]:
#convert the array of tuples to dataframe
towns_df = pd.DataFrame(university_towns, columns=['State', 'RegionName'])
towns_df.head()

             State                                         RegionName
0  Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1  Alabama[edit]\n           Florence (University of North Alabama)\n
2  Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3  Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4  Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n

In [0]:
# self-defined function applied to all elements in the df
def get_citystate(item):
  if '(' in item:
    return item[:item.find('(')]
  elif '[' in item:
    return item[:item.find('[')]
  else:
    return item

towns_df = towns_df.applymap(get_citystate)
towns_df.head(10)

     State     RegionName
0  Alabama        Auburn
1  Alabama      Florence
2  Alabama  Jacksonville
3  Alabama    Livingston
4  Alabama    Montevallo
5  Alabama          Troy
6  Alabama    Tuscaloosa
7  Alabama      Tuskegee
8   Alaska     Fairbanks
9  Arizona     Flagstaff

###**renaming columns and skipping rows**

In [0]:
olympics_df = pd.read_csv('/content/gdrive/My Drive/201911ML/olympics.csv')
olympics_df.head()

                   0         1     2     3  ...    12    13    14              15
0                NaN  ? Summer  01 !  02 !  ...  01 !  02 !  03 !  Combined total
1  Afghanistan (AFG)        13     0     0  ...     0     0     2               2
2      Algeria (ALG)        12     5     2  ...     5     2     8              15
3    Argentina (ARG)        23    18    24  ...    18    24    28              70
4      Armenia (ARM)         5     1     2  ...     1     2     9              12

[5 rows x 16 columns]

In [0]:
# passing parameter header=1 to skip the first row
olympics_df = pd.read_csv(
    '/content/gdrive/My Drive/201911ML/olympics.csv', 
    header=1)
olympics_df.head()

                Unnamed: 0  ? Summer  01 !  ...  02 !.2  03 !.2  Combined total
0        Afghanistan (AFG)        13     0  ...       0       2               2
1            Algeria (ALG)        12     5  ...       2       8              15
2          Argentina (ARG)        23    18  ...      24      28              70
3            Armenia (ARM)         5     1  ...       2       9              12
4  Australasia (ANZ) [ANZ]         2     3  ...       4       5              12

[5 rows x 16 columns]

In [0]:
new_names =  {'Unnamed: 0': 'Country',
               '? Summer': 'Summer Olympics',
               '01 !': 'Gold',
               '02 !': 'Silver',
               '03 !': 'Bronze',
               '? Winter': 'Winter Olympics',
               '01 !.1': 'Gold.1',
               '02 !.1': 'Silver.1',
               '03 !.1': 'Bronze.1',
               '? Games': '# Games',
               '01 !.2': 'Gold.2',
               '02 !.2': 'Silver.2',
               '03 !.2': 'Bronze.2'}

In [0]:
olympics_df.rename(columns=new_names, inplace=True)
olympics_df.head()

                   Country  Summer Olympics  ...  Bronze.2  Combined total
0        Afghanistan (AFG)               13  ...         2               2
1            Algeria (ALG)               12  ...         8              15
2          Argentina (ARG)               23  ...        28              70
3            Armenia (ARM)                5  ...         9              12
4  Australasia (ANZ) [ANZ]                2  ...         5              12

[5 rows x 16 columns]